# Дан прямоугольник с размерами 543×130 мм.
# Сколько квад­ратов со стороной 130 мм можно отрезать от него?

x = int(543 / 130)

print ("От прямоугольника с размером 543×130 мм")
print ("Можно отрезать "+str(x)+str(" квадрата со стороной 130 мм."))
