# Дано расстояние в сантиметрах. Найти число полных мет­ров в нем.

sm = int(input("Введите значение в сантиметрах: "))

meter = int(sm / 100)

print ("Число полных метров = "+str(meter)+str(" м."))
