# Дана масса в килограммах. Найти число полных центнеров в ней.

kg = int(input("Введите значение в килограммах: "))

cen = int(kg / 100)

print ("Число полных центнеров = "+str(cen)+str(" ц."))
