'''
Замечание
В задачах 3.12–3.15 условный оператор не использовать.

На складе товары находятся в 10-ярусном стеллаже, разбитом на 8 секций.
В каждой секции на каждом ярусе предусмот­рено 15 мест для товаров.
Нумерация мест показана на рис. 3.1. Склад обслуживается роботом.
Определить, в какой секции и на каком ярусе робот должен взять товар, находящийся на месте с заданным номером.

|        |    Секция 1   |   Секция 2    |  .......  |  Секция 8 |
| Ярус10 |               |               |           |           |
|  ...   |               |               |           |           |
| Ярус2  |121|122|...|   |               |           |           |
| Ярус1  | 1 | 2 |...| 15| 16| 17|...| 30|           |           |

Вариант задачи – отличается системой нумерации мест (см. рис. 3.2).

|        |    Секция 1   |   Секция 2    |  .......  |  Секция 8 |
| Ярус10 | 10| 20|...|   |               |           |           |
|  ...   |               |               |           |           |
| Ярус2  | 2 | 12|...|   |               |           |           |
| Ярус1  | 1 | 11|...|141|151|...|...|...|           |           |
'''

import math
s = int(input("Введите номер места в стеллаже: "))

tier = ["Ярус-10","Ярус-1","Ярус-2","Ярус-3","Ярус-4","Ярус-5","Ярус-6","Ярус-7","Ярус-8","Ярус-9","Ярус-10",]
section = ["Секция-8","Секция-1","Секция-2","Секция-3","Секция-4","Секция-5","Секция-6","Секция-7","Секция-8",]
n = math.ceil( s / 120)

x = s - (int( s / 120 ) * 120)
y = math.ceil( x / 15 )

n_b = s - (int( s / 10 ) * 10)
y_b = math.ceil( s / 150 )

print("1-ый вариант: "+str(tier[n]) +str(", ")+str(section[y]))
print("2-ой вариант: "+str(tier[n_b]) +str(", ")+str(section[y_b]))
