# Вывести на одной строке числа 47, 52 и 150 с двумя пробелами между ними.
a = int(47)
b = int(52)
c = int(150)
print(a,'',b,'',c)
