# Составить программу вывода на экран числа, вводимого с клавиатуры.
# После выводимого числа должно следовать сообщение «– вот какое число Вы ввели»

a = int (input("Введите число: "))

print(a, "– вот какое число Вы ввели")
