# Составить программу, которая запрашивает название футбольной команды
# и повторяет его на экране со словами «– это чемпион!»

name = input("Введите название футбольной команды: ")

print(name, "– это чемпион!")
