# Составить программу, которая запрашивает имя человека и повторяет его на экране.

name = input("Введите имя: ")

print(name)
