# Составить программу вывода на экран в одну строку трех
# любых чисел, вводимых с клавиатуры, с двумя пробелами между ними.

a = int(input("Введите 1-ое число: "))
b = int(input("Введите 2-ое число: "))
c = int(input("Введите 3-ое число: "))

print(a,'',b,'',c)
