# Вывести на экран числа 50 и 10 одно под другим.
a = int(50)
b = int(10)

print(a)
print(b)
