# Составить программу вывода на экран числа, вводимого с клавиатуры.
# Выводимому числу должно предшествовать сообщение «Вы ввели число».

a = int (input("Введите число: "))

print("Вы ввели число:", a)
