# Вывести на одной строке числа 31, 18 и 79 с одним пробелом между ними
a = int(31)
b = int(18)
c = int(79)
print(a, b, c)
