# Составить программу вывода на экран в одну строку четырех любых чисел,
# вводимых с клавиатуры, с одним пробелом между ними.

a = int(input("Введите 1-ое число: "))
b = int(input("Введите 2-ое число: "))
c = int(input("Введите 3-ое число: "))
d = int(input("Введите 4-ое число: "))

print(a,b,c,d)
