# Вывести на экран числа 5, 10 и 21 одно под другим.
a = int(5)
b = int(10)
c = int(21)

print(a)
print(b)
print(c)
