# Вывести на экран числа 1 и 2 одно под другим с пробелом между ними.
a = int(1)
b = int(2)

print(a)
print("")
print(b)
