# Дана сторона квадрата. Найти его периметр.

a = int(input("Введите сторону квадрата: "))

P = a * 4

print ("Периметр нашего квадрата равен", P)
