# Составить программу:
# а) вычисления значения функции z = 2x 3 – 3,44xy + 2,3x 2 – 7,1y + 2 при любых значениях х и y;
# б) вычисления значения функции d = 3,14(a + b) 3 + 2,75b 2 – 12,7a – 4,1 при любых значениях a и b.

x = int(input("Введите x: "))
y = int(input("Введите y: "))
a = int(input("Введите a: "))
b = int(input("Введите b: "))

z = 2 * x * 3 - 3.44 * x * y + 2.3 * x * 2 - 7.1 * y + 2
d = 3.14 * ( a + b ) * 3 + 2.75 * b * 2 - 12.7 * a * 4.1

print ( str(z) + " = 2x 3 – 3,44xy + 2,3x 2 – 7,1y + 2" )
print ( str(d) + " = 3,14(a + b) 3 + 2,75b 2 – 12,7a – 4,1" )
