# Даны два числа. Найти их сумму, разность, произведение, а также частное от деления первого числа на второе.

a = float(input("Введите число a: "))
b = float(input("Введите число b: "))

summa = a + b

difference = a - b

composition = a * b

division = a / b

print ("Сумма = " + str(summa))
print ("Разность = " + str(difference))
print ("Произведение = " + str(composition))
print ("Частное = " + str(division))
