# Составить программу вычисления значения функции
# a^2+10/на корень a^2+1
# при любом значении а.

a = int(input("Введите значение a: "))

y = (a**2 + 10)/((a**2 + 1)**0.5)

print(y)
