# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

x = int(input("Введите известную длину ребра куба: "))

V = x * x * x
S = x * x

print ("Объем куба V = " + str(V))
print ("Площадь боковой поверхности куба S = " + str(S))
