# Дан радиус окружности. Найти ее диаметр.

r = int(input("Введите радиус окружности:"))

D = 2 * r

print ("Диаметр нашей окружности =",D)
