'''
Для функций, заданных графически (рис. 4.3), определить
значение у при заданном значении х.
a)                           b)
     y                             y
    |                             |
   2|   ___________             \ |
    | /                        __\|___3________________ x
____|/____________x               |\0
   /|0  2                         | \
  / |                           -3|  \________________
'''
import math

x = float(input("Введите значение x варианта а): "))
x1 = float(input("Введите значение x варианта b): "))

if 0 < x < 2:
    y = x
elif 0 > x:
    y = x
elif x > 2:
    y = 2

if 0 < x1 < 3:
    y1 = -(x1)
elif 0 > x1:
    y1 = math.fabs(x1)
elif x1 > 3:
    y1 = -3   


print("a) Значение y = "+str(y))
print("b) Значение y = "+str(y1))
